/*Напишете програма на С, която съдържа 3 функции,
изнесете прототипите им в отделен .h файл.
1. Първата функция да калкулира най-малко общо кратно на две положителни
числа.
2. Втората функция връща абсолютна стойност на числата (положителната
стойност на числата).
a. Трябва да може да приеме като параметър float и да върне float.
b. Тествайте с инт и float.
3. Напишете функция, която калкулира корен квадратен от число.
a. Проверете дали резултатът е отрицателно число и върнете -1.
b. Използвайте втората си функция, за да обърнете числото в положително и
да намерите корен квадратен от него.*/
#include<stdio.h>
#include "prototypes.h"

int main() {
    
    lowestCommonMultiple();

    float x = -3.14;
    printf("The absolute value of %.2f is %.2f\n", x, absolute(x)); /* b. => не става с int*/

    printf("Enter a number to see it's square root:");
    scanf("%f", &x);
    printf("The square root of %.2f is %.2f\n", x, squareNum(x));

    return 0;
}
