/*Задача за имотен регистър

Напишете програма за имотен регистър. 

За всеки имот се записва уникален номер, номер от кадастъра, адрес: град, улица, номер, вход, етаж, апартамент номер. 

Също така за всеки имот може да има до десет собственика, като за всеки собственик се записва име, презиме, фамилия, адрес, 
ЕГН, номер на паспорта, дата на издаване, дата на изтичане, нотариален акт номер и дата, процент участие в имота. 

Цялата информация, която се записва в имотния регистър трябва да може да се запише в CSV файл и след това да може да се възстанови от същия. 
Необходими е да може да се пускат следните справки:
 - по номер в кадастъра, да изведе информация за него за имот и неговите собственици сортирани по процент участие в имота
 - по дадена град, улица и номер да се изведат всички собственици по азбучен ред
 - по зададен номер на паспорт да се изведе информация за дадено лице и имотите които притежава*/
#include "realEstate.h"

int main() {
    
    menu();

    return 0;
}