/*Напишете функцията int atof(char *s), която
преобразува стринг в число с десетична запетая. Тази функция е
подобна на разглежданата по-горе atoi(char *s), само че когато се
стигне до . точката, отделяща цялата част от дробната, трябва
да се пусне още един цикъл, който да изчисли числото в
дробната част по същия начин, както е числото в цялата част.
Само че тук при дробната част трябва да имаме една
променлива, която да умножаваме по 10 всеки път до края на
дробната част power *= 10; Накрая трябва да разделим
полученото число на тази променлива, за да получим реалното
число с плаващата заперая на точното място. */
#include<stdio.h>
#include<math.h>

double atof(char *s);

int main() {
    char string[] = "23.456";

    printf("%lf\n", atof(string));
}

double atof(char *s) {
    int i = 0, counter = 0;
    double number = 0.0, power = 10.0;
    
    while (s[i] != '.') {
        i++;
    }
    counter = i - 1;
    i = 0;

    while(s[i] != '\0') {
        
        if(counter >= 0) {
            while ((s[i] != '.')) {
                number += (s[i] - '0') * pow(10, counter);
                counter--;
                i++;
            }
            i++;
        }
        else {
            number += (s[i] - '0') / power;
            power *= 10;
            i++;
        }
    }
    return number;
}