//Да прочетем какво се случва със стойността на променливата x:
#include<stdio.h>

int main() {

    char x = 8;
    //променливата х има стойност 8

    x = x - 2;
    //присвояваме нова стойност на х, която е равна на стойността на самата променлива минус 2 което е равно на 6

    x = x + 6;
    //отново присвояваме нова стойност на х равна на последната й стойност(6) плюс 6, което е равно на 12

    x = x - 10 + 2;
    //присвояваме нова стойност на х равна на последната стойност на променливата(12) минус 10 и добавяме 2, което е равно на 4
    
    printf("%d\n", x);
    return 0;
}