/*Дефинирайте едномерен масив int с 10 елемента =
{100,90,80,70,60,50,40,30,20,10} Дефинирайте пойнтер, който ще сочи към
масива.
Достъпете 3 тия елемент от масива и му задайте стойност 5.
Достъпете 4 тия елемент и му задайте стойност 33.
Достъпете 5 тия елемент и го намалете със 7.
Достъпете 7 мия елемент и го увеличете с 10.
Достъпете 10 тия елемент и го умножете по 3.
Изпишете го по двата възможни начина и закоментирайте единия.
Принтирайте на екрана всички елементи на масива.*/
#include<stdio.h>

int main() {
    int arr[] = {100,90,80,70,60,50,40,30,20,10};
    int *pArr = arr;

    /*Достъпете 3 тия елемент от масива и му задайте стойност 5.*/
    pArr[2] = 5;
    /*arr[2] = 5;*/
    printf("%d\n", arr[2]);

    /*Достъпете 4 тия елемент и му задайте стойност 33.*/
    pArr[3] = 33;
    /*arr[3] = 33;*/
    printf("%d\n", arr[3]);

    /*Достъпете 5 тия елемент и го намалете със 7.*/
    pArr[4] = pArr[4] - 7;
    /*arr[4] = arr[4] - 7;*/
    printf("%d\n", arr[5]);
    
    /*Достъпете 7 мия елемент и го увеличете с 10.*/
    pArr[6] = pArr[6] + 10;
    /*arr[6] = arr[6] + 10;*/
    printf("%d\n", arr[6]);
    
    /*Достъпете 10 тия елемент и го умножете по 3.*/
    pArr[9] = pArr[9] * 3;
    /*arr[9] = arr[9] * 3;*/
    printf("%d\n", arr[9]);

    int i;
    for(i = 0; i < 10; i++){
        printf("%d ", pArr[i]);
    }

    return 0;


}