/*Напишете програма, която чете съобщение, след което го
принтира в обратен ред:
Enter a message: I am Miro.
Reversal is : .oriM ma I
Използвайте getchar() за да вземете символите от конзолата, запазете ги в
масив от чарове, прекратете четенето до достигане на \n. Използвайте
пойнтер, който да сочи към текущата позиция на масива. Чрез него
принтирайте масива в обратен ред.*/
#include<stdio.h>

int main() {
    char str[16];
    int c;
    char *p = str;
    
    while((c = getchar()) != '\n'){
        *p = c;
        p++;
    }

    while(*p-- != str[0]){
        
        printf("%c", *p);
    }

    return 0;
}