/*Първата функция strcpy(s, t), която копира низа t в низа s. Щеше да е
чудесно просто да кажем s = t, но по този начин ще копираме указателите, а
не всички символи от единия в другия масив. За да стане това трябва да
обходим целия масив символ по символ и като използваме цикъл и да
присвоим стойността всеки един елемент от единия масив на същата
позиция в другия. */
#include<stdio.h>

void my_strcpy(char *t, char *s){
    while (*s++ = *t++)
        ;
    
}

int main() {
    char arr[] = "Nikolay";
    char arrTo[] = "Georgiev";

    my_strcpy(arr, arrTo);

    printf("%s\n", arrTo);

    return 0;
}