/*Дефинирайте и инициализирайте int променлива = 34 и
пойнтер към нея.
Опитайте да ги разместите, като поредност (първо да е
пойнтерът, после променливата).*/
#include<stdio.h>

int main(){
    /*
    int *p = &a;
    int a = 34;
    Когато насочим пойнтър към недефинирана променлива програмата не се компилира, защото 
    променливата а все още няма заделен адрес в паметта към който да сочи пойтъра.*/



    /*Можете ли да умножите пойнтер по пойнтер?*/
    int a = 34;
    int *p = &a;

    int b = 10;
    int *p1 = &b;

    /*printf("Can we multiply pointer with a pointer? %d\n", p * p1); 
    Тъй като p и p1 имат стойности които са адреси в паметта не можем да ги умножаваме и горният ред ни дава грешка*/

    /*При тази декларация колко пойнтера имаме:
    int *p, k;*/
    int *p2, k; /*имаме 2 променливи от тип инт но само едната "*p" е пойнтър тъй като за "k" не сме иползвали астерикса, което ще даде грешка в долните редове*/
    p2 = &a;
    k = &a; /*k ще има стойност адреса на променливата "а", но не е пойнтър към нея т.е. не можем да "надникнем" и да разберем стойността която се съдържа в този адрес*/


    printf("*p = %d, p = %p\n", *p2, p2);
    printf("k = %d, k = %p\n", k, k); /*Принтирайки "к" с астерикс ни дава конфликт в типовете*/
    return 0;
}
