/*Представете служителите във фирма в структура с членове:
пореден номер, име, презиме, фамилия, позиция, трудов стаж в години,
заплата в лева, указател към структурата, описващ неговия началник.
Напишете програма, която въвежда 10 служителя, които се съхраняват в
масив от описаните структури. Въвеждането на служителите може да стане
на два паса, първо въвеждане на всички данни без указателя към
началника и на втори пас, указване на всеки служител кой е неговият
началник

Използвайки предишното упражнение, опишете структурите и
прототипите на функциите в отделен заглавен файл с разширение *.h, a
телата на функциите в един или няколко *.c сорс файлове*/
#include"header.h"


int main()
{
    struct employee empList[LIST_SIZE];
    
    struct manager managerList[LIST_SIZE];

    for (int i = 0; i < LIST_SIZE; i++)
    {
        enterEmployees(empList, i);
        enterManagers(managerList, i);
    }

    printList(empList, managerList);
    return 0;
}

/*Не успях да направя така че да се въвеждат данните на мениджърите през структурата на служителите които пък са в масив..
Ще съм много благодарен ако ми напишете като коментар как може това да се осъществи*/